teverett/cthugha-esp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# CPU - ESP32-P4 board max is 360 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y

# Required for MIPI-DSI features
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Disable task watchdog (visualization is CPU-intensive)
CONFIG_ESP_TASK_WDT_EN=n

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
